# 1
print(3 + 6)
print(3 - 6)
print(3 / 6)
print(3 * 6)
print(3 - 6)
print(3 / 6)
print(3 * 6)
print(3 / 6)
print(3 + 6)
print(3 - 6)


print(3 + 6)
print(3 - 6)
print(3 / 6)
print(3 * 6)
print(3 + 6)
print(3 - 6)
print(3 / 6)
print(3 * 6)
print(3 + 6)
print(3 - 6)

# 2
# explicity - თავის არსში, ეს პრინციპი ხელს უწყობს ჩვენს კოდექსში სიცხადეს და პირდაპირობას. საუბარია იმაზე, რომ არ დატოვოთ ადგილი გამოცნობისთვის ან ფარული ვარაუდებისთვის. პითონში გამოკვეთილობა ნიშნავს კოდის დაწერას, რომელიც მკაფიოდ გამოხატავს მის განზრახვებს და არ ეყრდნობა "ჯადოსნობას" ან ფარულ ქცევას.

# implicity - პითონში ტიპის კონვერტაცია გულისხმობს მონაცემთა ერთი ტიპის მნიშვნელობის სხვა მონაცემთა ტიპად გადაქცევას. პითონში მონაცემთა ტიპების კონვერტაციის ორი გზა არსებობს. იმპლიციტური ტიპის კონვერტაციისას, პითონი ავტომატურად გარდაქმნის მონაცემთა ერთ ტიპს სხვა მონაცემთა ტიპზე, მომხმარებლის ყოველგვარი საჭიროების გარეშე.

# 3
number = [3]

for i in range():
    if 3 > number:
        print("number is big")
    else:
        print("number is small")

# 4
# chanawerze iyo gadasaxedi









































































