#1
age1 = input("My age is: ")
print (type(age1))

#2
# int - ინტი არის ფუნქცია რომელსაც შეუძლია სტრინგში მყოფი რიცხვი გადააქციოს ინტეჯერად ანუ ჩვეულებრივ რიცხვად
# str - სტრინგ მეთოდი არის საშუალება იმისა რომ ჩვეულებრივი რაიმე წინადადება ან თუნდაც სიტყვა ჩავსვათ სტრინგში ანუ ბრჭყალებში
#booulean - ბულიენი არის მეთოდი რომელიც უმეტეს შემთხვევაში გვეხმარება მათემატიკურ ოპერაციებში მაგალითად თუ რიცხვი არის კენტი ბულიენის დახმარებით შეგიძლიათ დაადგინოთ მართალია თუ ტყუილი

#3 
age1 = int(input("My age is: "))
print(age1 + 5)
